[
    {
        "sentence_id": 0,
        "sentence": "The function of criticism describes the rise and fall of British literary criticism.",
        "article_id": 2
    },
    {
        "sentence_id": 1,
        "sentence": "This is the postscript to Terry Eagleton's previous book \"Literary Theory,\" which describes the major recent trends in literary criticism.",
        "article_id": 2
    },
    {
        "sentence_id": 2,
        "sentence": "According to the 'function of criticism', modern criticism begins with 'speakers and observers', expressing the understanding of the new revolutionary society towards itself.",
        "article_id": 2
    },
    {
        "sentence_id": 3,
        "sentence": "Since then, there has been no similar consensus on our company's goals.",
        "article_id": 2
    },
    {
        "sentence_id": 4,
        "sentence": "Therefore, the status of literary critics declined from Edison to the \"literary figures\" of the 19th century, ultimately becoming scholars of the 20th century.",
        "article_id": 2
    },
    {
        "sentence_id": 5,
        "sentence": "At some point in the 19th century, critics began to diverge and increasingly viewed literature as a \"treasure trove of common human wisdom,\" rather than those retiring into increasingly narrow professional fields.",
        "article_id": 2
    },
    {
        "sentence_id": 6,
        "sentence": "Censorship is the latest important attempt to link in-depth discussions on individual works with broader discussions on the development of society as a whole.",
        "article_id": 2
    },
    {
        "sentence_id": 7,
        "sentence": "But in the long run, this will not establish a closer connection between universities and the public, or even with their own students.",
        "article_id": 2
    },
    {
        "sentence_id": 8,
        "sentence": "Recently, the English department has used a series of strong literary theories to resist those who question their teaching rights.",
        "article_id": 2
    },
    {
        "sentence_id": 9,
        "sentence": "However, these challenges must continue.",
        "article_id": 2
    },
    {
        "sentence_id": 10,
        "sentence": "Eagleton believed that the challenge is Marxist.",
        "article_id": 2
    },
    {
        "sentence_id": 11,
        "sentence": "The only surprising aspect of the critic function is that Eagleton's evaluation of Edison is unique among critics, and Edison is hardly an imaginative character.",
        "article_id": 2
    },
    {
        "sentence_id": 12,
        "sentence": "As Eagleton said, modern critics should be like Addison, \"equal co commentators with the reader community, whose views are softened by their common views",
        "article_id": 2
    },
    {
        "sentence_id": 13,
        "sentence": "Eagleton is unsure which viewpoints he believes modern critics should 'soften', as he has a 'quick sense' of the reader's' overall perspective '.",
        "article_id": 2
    },
    {
        "sentence_id": 14,
        "sentence": "Literary Theory \"is the greatest of Eagleton's two recent books, serving as a guide for observing different critical schools of thought in contemporary times and providing a simple way to remember their uniqueness.",
        "article_id": 2
    },
    {
        "sentence_id": 15,
        "sentence": "Eagleton collected biases from each group towards the absurd behavior of competitors.",
        "article_id": 2
    },
    {
        "sentence_id": 16,
        "sentence": "As he himself said, because we live in a world of amateur common sense and professional knowledge, this has proven to be quite successful.",
        "article_id": 2
    },
    {
        "sentence_id": 17,
        "sentence": "This is really interesting, it's not good for everyone.",
        "article_id": 2
    },
    {
        "sentence_id": 18,
        "sentence": "This is what he describes as the 'Levitical school' compared to deconstructionists: true English literature is rich, complex, emotional, and unique in language, and the best poetry, to put it mildly, is a poem that sounds like an apple when read aloud.",
        "article_id": 2
    },
    {
        "sentence_id": 19,
        "sentence": "The \"health\" and \"vitality\" of this language are products of \"rational\" civilization: it embodies the creative whole lost in history, so reading literature is a reconnection with its roots.",
        "article_id": 2
    },
    {
        "sentence_id": 20,
        "sentence": "Deconstructionism reintroduces traditional liberal humanism, whose calm indulgence in its own chaos is always a clear sign of unconscious privilege.",
        "article_id": 2
    },
    {
        "sentence_id": 21,
        "sentence": "The literary evidence of deconstructionists is that language cannot be boring like in a bar, but can only discuss its own failures.",
        "article_id": 2
    },
    {
        "sentence_id": 22,
        "sentence": "Eagleton's privileged position as a British Marxist allowed him to happily defeat everyone in front of him, and also made it as difficult as possible for 'liberal humanists' to counterattack.",
        "article_id": 2
    },
    {
        "sentence_id": 23,
        "sentence": "The ultimate society he envisioned seemed very pleasant, an eternal and cruel society that expressed a strong sense of 'civic solidarity'.",
        "article_id": 2
    },
    {
        "sentence_id": 24,
        "sentence": "At his most solemn moment, he lamented that universities had become servants of a society guided by consumption rather than value.",
        "article_id": 2
    },
    {
        "sentence_id": 25,
        "sentence": "Without a doubt, admitting their guilt was their later consumption of Eagleton's book.",
        "article_id": 2
    },
    {
        "sentence_id": 26,
        "sentence": "In the 1960s, as a smart student, Eagleton integrated into the university system through the usual channels.",
        "article_id": 2
    },
    {
        "sentence_id": 27,
        "sentence": "There, he developed his ideas into an influential academic community.",
        "article_id": 2
    },
    {
        "sentence_id": 28,
        "sentence": "He has always been skeptical of \"English\", especially \"fine reading\".",
        "article_id": 2
    },
    {
        "sentence_id": 29,
        "sentence": "The last few sections of literary theory promote Eagleton's favorite literary method, linking literature to the way we organize our lives together",
        "article_id": 2
    },
    {
        "sentence_id": 30,
        "sentence": "This is the method of Marxism.",
        "article_id": 2
    },
    {
        "sentence_id": 31,
        "sentence": "However, Eagleton found that Marxist thought did not fully and satisfactorily cover the field of 'we live together'.",
        "article_id": 2
    },
    {
        "sentence_id": 32,
        "sentence": "He cleverly referred to it as the 'intimate zone' or 'intimate zone'.",
        "article_id": 2
    },
    {
        "sentence_id": 33,
        "sentence": "There, he recently discovered the usefulness of Freud: Freudianism is a science dedicated to liberating people from things that hinder their achievement and happiness.",
        "article_id": 2
    },
    {
        "sentence_id": 34,
        "sentence": "In this regard, it shares similarities with radical politics.",
        "article_id": 2
    },
    {
        "sentence_id": 35,
        "sentence": "In his five page work 'Sons and Lovers', Eagleton analyzed how Freud and Marx got along: from the perspective of Oedipus and class, Paul's image of his father as' weak' and his mother as' strong 'can be said to be. We can see that from the perspective of unconscious processes and certain social forces and relationships, the interpersonal relationships between absent and violent fathers, ambitious and emotionally demanding mothers, and sensitive children are understandable.",
        "article_id": 2
    },
    {
        "sentence_id": 36,
        "sentence": "According to Eagleton's discussion of the novel, Paul seems to have an Oedipus complex towards his mother, but he prefers his father's words over his own.",
        "article_id": 2
    },
    {
        "sentence_id": 37,
        "sentence": "After this demonstration, Eagleton felt qualified to refute all these \"amateur critics who don't like the entire methodology and prefer to work in situations of low premonition, intuition, and sudden perception",
        "article_id": 2
    },
    {
        "sentence_id": 38,
        "sentence": "He expressed regret for their loose wording, claiming that the sensory structure of life experiences can be transformed into internal reactions based on habits and biases.",
        "article_id": 2
    },
    {
        "sentence_id": 39,
        "sentence": "Instead of 'dry theories' and controversial ideas.",
        "article_id": 2
    },
    {
        "sentence_id": 40,
        "sentence": "But Eagleton's views on his son and lover are not profound in the novel and are not worth debating at all.",
        "article_id": 2
    },
    {
        "sentence_id": 41,
        "sentence": "In fact, most replicas now display similar information on the back cover.",
        "article_id": 2
    },
    {
        "sentence_id": 42,
        "sentence": "Critique and Ideology \"(1976),\" Marxism and Literary Theory \"(1976), and Walter Benjamin's\" Towards Revolutionary Criticism \"(1981) are Eagleton's early works on the function of criticism.",
        "article_id": 2
    },
    {
        "sentence_id": 43,
        "sentence": "The most important of these are criticism and ideology.",
        "article_id": 2
    },
    {
        "sentence_id": 44,
        "sentence": "In his book, Eagleton claims to have laid the theoretical foundation for the British Marxist critical school.",
        "article_id": 2
    },
    {
        "sentence_id": 45,
        "sentence": "In the new Eagleton criticism, the structure of the work is no longer simply seen as a \"microcosm or ideological norm\" like earlier, more \"reductionist\" Marxist criticism.",
        "article_id": 2
    },
    {
        "sentence_id": 46,
        "sentence": "Ideology is not the 'truth' of a text.",
        "article_id": 2
    },
    {
        "sentence_id": 47,
        "sentence": "Text constitutes a structure: it constructs ideology, reconstructs it in a relatively autonomous way, in order to transform and reshape it in aesthetic production, and the text itself is also influenced to varying degrees by ideology.",
        "article_id": 2
    },
    {
        "sentence_id": 48,
        "sentence": "In this destructive practice, the text encounters ideology, which is a relatively structured form that influences its unique values and relationships. It faces a 'concrete logic' that constitutes the periphery of text production.",
        "article_id": 2
    },
    {
        "sentence_id": 49,
        "sentence": "These phrases echo abstract concepts and weaken attention, but as far as we know, none of these can change the fact that Marxist criticism explores how \"ideology\" enters works of art.",
        "article_id": 2
    },
    {
        "sentence_id": 50,
        "sentence": "In the latter half of Critique and Ideology, Eagleton elaborates on his modern Marxist approach through a brief overview of 19th century novels.",
        "article_id": 2
    },
    {
        "sentence_id": 51,
        "sentence": "Dickens' understanding of the social reality of his time conflicted with his traditional 'bourgeois ethics'; George Eliot avoided the tragic contradictions that existed in rural society; Conrad's attitude towards British imperialism was fundamentally contradictory.",
        "article_id": 2
    },
    {
        "sentence_id": 52,
        "sentence": "These ideas do not seem as novel or profound as previous theories.",
        "article_id": 2
    },
    {
        "sentence_id": 53,
        "sentence": "But this may be because their development space is too small.",
        "article_id": 2
    },
    {
        "sentence_id": 54,
        "sentence": "Eagleton ultimately felt the pressure and demonstrated in a long-term study how his literary approach was' deep and rich '.",
        "article_id": 2
    },
    {
        "sentence_id": 55,
        "sentence": "Clarissa's Rape \"is a work that separates her first theoretical book from her most recent one.",
        "article_id": 2
    },
    {
        "sentence_id": 56,
        "sentence": "In his first book 'Marxism and Literary Criticism', Eagleton concluded that if we cannot connect past literature...",
        "article_id": 2
    },
    {
        "sentence_id": 57,
        "sentence": "We do not fully understand our own situation in the struggle between men and women against exploitation, so it is unlikely to effectively change this situation.",
        "article_id": 2
    },
    {
        "sentence_id": 58,
        "sentence": "In the Clarissa rape case, he began to demonstrate how to use Richardson to achieve this goal.",
        "article_id": 2
    },
    {
        "sentence_id": 59,
        "sentence": "For Eagleton, Richardson's novel is a social document that showcases how an ambitious bourgeoisie is infected by the \"barbarism\" of the ruling class it seeks to overthrow.",
        "article_id": 2
    },
    {
        "sentence_id": 60,
        "sentence": "These two social classes urgently need the softening effect of \"female values\".",
        "article_id": 2
    },
    {
        "sentence_id": 61,
        "sentence": "Clarissa embodies these female values.",
        "article_id": 2
    },
    {
        "sentence_id": 62,
        "sentence": "This ongoing critical work aims to serve as a mature model for Marxist criticism in the UK, but it is actually a very small book.",
        "article_id": 2
    },
    {
        "sentence_id": 63,
        "sentence": "The section directly discussing Clarissa is only 50 pages long and has thick fonts.",
        "article_id": 2
    },
    {
        "sentence_id": 64,
        "sentence": "The first half of this book does not mention Clarissa at all.",
        "article_id": 2
    },
    {
        "sentence_id": 65,
        "sentence": "This is Pamela's fable: \"The new class has won the respect and acceptance of the old class with its charm and virtues",
        "article_id": 2
    },
    {
        "sentence_id": 66,
        "sentence": "However, in the end, Pamela became a \"symbolic victim of conspiracy\" in the class alliance established between the bourgeoisie and the aristocracy.",
        "article_id": 2
    },
    {
        "sentence_id": 67,
        "sentence": "As you know from reading, Pamela does not fit Eagleton's description of her.",
        "article_id": 2
    },
    {
        "sentence_id": 68,
        "sentence": "B. For example, Pamela is not a 'suitable 2D drawing feature', she is not just a victim.",
        "article_id": 2
    },
    {
        "sentence_id": 69,
        "sentence": "Eagleton's conclusion is somewhat disjointed, as Pamela represents a comedic moment of ambitious, lively, and determined class, miraculously distancing herself from serious injuries like all comics.",
        "article_id": 2
    },
    {
        "sentence_id": 70,
        "sentence": "This animated movie is by Eagleton.",
        "article_id": 2
    },
    {
        "sentence_id": 71,
        "sentence": "Pamela \"is a comic book by Eagleton that tells the story of women earning money for the bourgeoisie.",
        "article_id": 2
    },
    {
        "sentence_id": 72,
        "sentence": "Clarissa is a manga about female victims of patriarchal oppression.",
        "article_id": 2
    },
    {
        "sentence_id": 73,
        "sentence": "Clarissa and Lovelace's family are her oppressors.",
        "article_id": 2
    },
    {
        "sentence_id": 74,
        "sentence": "His social language is one of his tools of oppression.",
        "article_id": 2
    },
    {
        "sentence_id": 75,
        "sentence": "She always obeys allowed words, which is a sign of her well-trained obedience to the power network.",
        "article_id": 2
    },
    {
        "sentence_id": 76,
        "sentence": "It is from this network that Lovelace attempts to release it, so that he can print it out through his more sinister power network - a complex metaphor.",
        "article_id": 2
    },
    {
        "sentence_id": 77,
        "sentence": "Eagleton received a lot of W.",
        "article_id": 2
    },
    {
        "sentence_id": 78,
        "sentence": "Warner's deconstructionists have read Clarissa, and although Eagleton later showed a relaxed and cheerful personality, Warner strongly hopes to shatter Clarissa's resistance to Lovelace.",
        "article_id": 2
    },
    {
        "sentence_id": 79,
        "sentence": "Warner exposed his emotional issues in a rather indecent way, but he at least carefully studied some of the language strategies used by Lovelace and Clarissa.",
        "article_id": 2
    },
    {
        "sentence_id": 80,
        "sentence": "Eagleton showed no signs of doing so for himself.",
        "article_id": 2
    },
    {
        "sentence_id": 81,
        "sentence": "Eagleton believed that Lovelace was Clarissa's main oppressor.",
        "article_id": 2
    },
    {
        "sentence_id": 82,
        "sentence": "His family motivation can be explained by Marxist class theory, but what is his motivation?",
        "article_id": 2
    },
    {
        "sentence_id": 83,
        "sentence": "The fact that Lovelace represents the 'barbaric behavior of the upper class' does not fully explain his actions.",
        "article_id": 2
    },
    {
        "sentence_id": 84,
        "sentence": "However, Lovelace was clearly troubled by the 'yellow fantasy'.",
        "article_id": 2
    },
    {
        "sentence_id": 85,
        "sentence": "This is where Freud came into play.",
        "article_id": 2
    },
    {
        "sentence_id": 86,
        "sentence": "Eagleton searched for 'Don King Fantasy' for us and returned a somewhat disjointed report: Startled by the integrity of his' penis' and the unnamed threat to his gender, Lovelace must possess Clarissa so that he can retrieve his lost penis and uncover the reassuring veil of her 'castration'.",
        "article_id": 2
    },
    {
        "sentence_id": 87,
        "sentence": "Afterwards, Eagleton avoided further discussion of Lovelace.",
        "article_id": 2
    },
    {
        "sentence_id": 88,
        "sentence": "To achieve this, he must talk about Clarissa, whom he avoids.",
        "article_id": 2
    },
    {
        "sentence_id": 89,
        "sentence": "Then he must find out what has had such a devastating impact on everyone, because apart from Lovelace, we cannot imagine Clarissa's pain.",
        "article_id": 2
    },
    {
        "sentence_id": 90,
        "sentence": "Clarissa of Eagleton remains a noble image of an oppressed woman, a struggling immortal girl.",
        "article_id": 2
    },
    {
        "sentence_id": 91,
        "sentence": "Considering this, Eagleton became increasingly angry about Lovelace's \"severe lack of adult sexual ability\".",
        "article_id": 2
    },
    {
        "sentence_id": 92,
        "sentence": "He is a 'poor character' who occupies too much space in the novel.",
        "article_id": 2
    },
    {
        "sentence_id": 93,
        "sentence": "Eagleton, like Warner, represents the tendency of modern critics to stand on one side in Clarissa's unsettling conflict.",
        "article_id": 2
    },
    {
        "sentence_id": 94,
        "sentence": "This itself is enough to prove that our society is slowly getting rid of the worst habits, and may even question its ability to do so.",
        "article_id": 2
    },
    {
        "sentence_id": 95,
        "sentence": "Yuri Lotman is one of the Soviet critics cited by Eagleton in \"Literary Theory\", and he believes that the greatest works are those that contain the most \"information\"",
        "article_id": 2
    },
    {
        "sentence_id": 96,
        "sentence": "Eagleton often quotes Brecht as the most outstanding among all Marxist writers, defining valuable writing as' no longer despicable, mediocre, or ordinary, no longer provoking thought '.",
        "article_id": 2
    },
    {
        "sentence_id": 97,
        "sentence": "Clarissa has more information than Eagleton himself can find, which has little to do with Eagleton's' Marxism '.",
        "article_id": 2
    },
    {
        "sentence_id": 98,
        "sentence": "His practice did not even touch upon the more complex issues that Marxist literature may raise.",
        "article_id": 2
    },
    {
        "sentence_id": 99,
        "sentence": "Eagleton's ability as a critic has not yet developed.",
        "article_id": 2
    },
    {
        "sentence_id": 100,
        "sentence": "This can be seen from his first article about the Nameless Judas.",
        "article_id": 2
    },
    {
        "sentence_id": 101,
        "sentence": "In this book, he has not yet assembled the device he currently uses to conceal his limitations as a critic, namely the combination of Marx and Freud.",
        "article_id": 2
    },
    {
        "sentence_id": 102,
        "sentence": "Eagleton quoted Hardy's own description of the novel, calling it a 'deadly war between mind and body'.",
        "article_id": 2
    },
    {
        "sentence_id": 103,
        "sentence": "Eagleton eagerly explained that this deadly war between \"mind and body\" should be interpreted as a \"war between the human mind and the obstructive body of stubborn society\" - Judas should be seen as a novel about social injustice.",
        "article_id": 2
    },
    {
        "sentence_id": 104,
        "sentence": "But Hardy refers to something more specific than Jude's war on society, he refers to Jude's disastrous relationship with women, especially Sue.",
        "article_id": 2
    },
    {
        "sentence_id": 105,
        "sentence": "Eagleton avoided discussing Su's behavior.",
        "article_id": 2
    },
    {
        "sentence_id": 106,
        "sentence": "On the contrary, in a series of unique echo phrases, he expressed some praise to Hardy with his left hand, praising his record of Su's \"emotional structure\" in a realistic and \"opaque\" way:",
        "article_id": 2
    },
    {
        "sentence_id": 107,
        "sentence": "Its elusive complexity partly stems from its transcendence of itself, highlighting the chaotic and ambiguous emotional structures that belong to the entire period.",
        "article_id": 2
    },
    {
        "sentence_id": 108,
        "sentence": "Therefore, his opacity and incoherence as a character are not only personal characteristics, but also cannot prove that Hardy did not fully recognize these features; It is precisely in its opacity and contradictions that it is most fully aware and representative.",
        "article_id": 2
    },
    {
        "sentence_id": 109,
        "sentence": "But Hardy was well aware of what had happened between Su and the man who loved her.",
        "article_id": 2
    },
    {
        "sentence_id": 110,
        "sentence": "Her contradictions are far from opaque, and every evasive response she makes has its reasons.",
        "article_id": 2
    },
    {
        "sentence_id": 111,
        "sentence": "Like Clarissa later on, Eagleton never discovered what they were.",
        "article_id": 2
    },
    {
        "sentence_id": 112,
        "sentence": "If literary theory is not based on literary reading, it has little value.",
        "article_id": 2
    }
]