[
    {
        "sentence_id": 0,
        "sentence": "The critical function describes the rise and fall of British literary criticism.",
        "article_id": 1
    },
    {
        "sentence_id": 1,
        "sentence": "It is a postscript to Terry Igleton's previous book 'The Theory of Literature', which describes the major trends in recent literary criticism.",
        "article_id": 1
    },
    {
        "sentence_id": 2,
        "sentence": "According to the 'function of criticism', modern criticism begins with the 'speaker and audience' and expresses the understanding of the new revolutionary society towards itself.",
        "article_id": 1
    },
    {
        "sentence_id": 3,
        "sentence": "Since then, there has been no similar consensus on the goals of our society.",
        "article_id": 1
    },
    {
        "sentence_id": 4,
        "sentence": "Therefore, the status of literary critics declined from Edison to \"literary figures\" of the 19th century, and ultimately became scholars of the 20th century.",
        "article_id": 1
    },
    {
        "sentence_id": 5,
        "sentence": "At some point in the 19th century, critics began to diverge, increasingly viewing literature as a \"treasure trove of common human intelligence,\" and those who returned to increasingly specialized fields.",
        "article_id": 1
    },
    {
        "sentence_id": 6,
        "sentence": "Censorship is the final important attempt to connect well-trained individual work discussions with broader societal development discussions.",
        "article_id": 1
    },
    {
        "sentence_id": 7,
        "sentence": "But in the long run, this has not established a closer connection between universities and the public, even with their own students.",
        "article_id": 1
    },
    {
        "sentence_id": 8,
        "sentence": "Recently, the English department has employed a series of powerful literary theories to counter those who challenge their teaching rights.",
        "article_id": 1
    },
    {
        "sentence_id": 9,
        "sentence": "However, these challenges must continue.",
        "article_id": 1
    },
    {
        "sentence_id": 10,
        "sentence": "Eagleton believes that this is a challenge to Marxism.",
        "article_id": 1
    },
    {
        "sentence_id": 11,
        "sentence": "The only surprising aspect of the 'critical function' is that Eagleton's evaluation of Edison is unique to critics, and Edison is hardly a creative figure.",
        "article_id": 1
    },
    {
        "sentence_id": 12,
        "sentence": "As Eagleton said, contemporary critics should be like Addison, 'equal to the reader community, whose views are softened by their common ground'.",
        "article_id": 1
    },
    {
        "sentence_id": 13,
        "sentence": "Eagleton is unsure which viewpoints he believes modern critics should 'soften' and has a 'quick sense' of the 'consensus' among readers.",
        "article_id": 1
    },
    {
        "sentence_id": 14,
        "sentence": "Literary Theory \"is the largest of Eagleton's two recent books, providing an observational guide for various critical schools of our time and offering a simple way to remember their uniqueness.",
        "article_id": 1
    },
    {
        "sentence_id": 15,
        "sentence": "Eagleton collected biases from each group towards the absurd behavior of competitors.",
        "article_id": 1
    },
    {
        "sentence_id": 16,
        "sentence": "As he himself said, because we live in a world of amateur knowledge and experience, it has been proven to be quite successful.",
        "article_id": 1
    },
    {
        "sentence_id": 17,
        "sentence": "He can really be funny at the cost of sacrificing everyone.",
        "article_id": 1
    },
    {
        "sentence_id": 18,
        "sentence": "Here is his description of the 'Leviathan School' compared to deconstructionists: True English literature is rich, complex, emotional, and unique in language, and at least to say, the best poetry is read aloud, sounding like chewing an apple.",
        "article_id": 1
    },
    {
        "sentence_id": 19,
        "sentence": "The \"health\" and \"vitality\" of this language are products of \"rational\" civilization: it reflects the creative integrity lost in history, so reading literature is a unity with one's own roots.",
        "article_id": 1
    },
    {
        "sentence_id": 20,
        "sentence": "Deconstructionism has revived traditional liberal humanism, and its cold and ruthless magnanimity is confusing, always a clear sign of unconscious privilege.",
        "article_id": 1
    },
    {
        "sentence_id": 21,
        "sentence": "Deconstructive literature proves that language cannot be as boring as in a bar, it can only discuss its own failures.",
        "article_id": 1
    },
    {
        "sentence_id": 22,
        "sentence": "Eagleton's privileged position as a British Marxist made him happy to defeat everyone in front of himself, while the 'liberal humanists' were as difficult to resist as possible.",
        "article_id": 1
    },
    {
        "sentence_id": 23,
        "sentence": "The ultimate society he represents sounds very pleasant, eternal and cruel, expressing a strong sense of 'citizen solidarity'.",
        "article_id": 1
    },
    {
        "sentence_id": 24,
        "sentence": "In more solemn moments, he complained that universities have become servants of \"a society guided by consumption rather than values\".",
        "article_id": 1
    },
    {
        "sentence_id": 25,
        "sentence": "Confessing their crimes is undoubtedly their further consumption of Eagleton's books.",
        "article_id": 1
    },
    {
        "sentence_id": 26,
        "sentence": "Eagleton was a smart student in the 1960s who integrated into the university system through conventional channels.",
        "article_id": 1
    },
    {
        "sentence_id": 27,
        "sentence": "There, he developed his ideas into an influential academic community.",
        "article_id": 1
    },
    {
        "sentence_id": 28,
        "sentence": "He has always been skeptical of 'English', especially 'reading carefully'.",
        "article_id": 1
    },
    {
        "sentence_id": 29,
        "sentence": "The final section of 'Literary Theory' promotes Eagleton's favorite literary method, linking literature to 'how we organize life together'.",
        "article_id": 1
    },
    {
        "sentence_id": 30,
        "sentence": "This is the method of Marxism.",
        "article_id": 1
    },
    {
        "sentence_id": 31,
        "sentence": "However, Eagleton found that Marxist thought did not fully and satisfactorily cover the field of 'we live together'.",
        "article_id": 1
    },
    {
        "sentence_id": 32,
        "sentence": "He cleverly referred to it as the 'intimate realm' or 'intimate realm'.",
        "article_id": 1
    },
    {
        "sentence_id": 33,
        "sentence": "It was here that he recently discovered Freud's usefulness: Freudianism is a science aimed at liberating humanity from things that hinder its realization and happiness.",
        "article_id": 1
    },
    {
        "sentence_id": 34,
        "sentence": "In this regard, it is similar to radical politics.",
        "article_id": 1
    },
    {
        "sentence_id": 35,
        "sentence": "Eagleton analyzed how Freud and Marx got along in his five page book \"Sons and Lovers\": we can discuss Paul's \"weak\" image of his father and his \"strong\" image of his mother from the perspectives of Oedipus and class. We see that from the perspective of unconscious processes and certain social forces and relationships, the interpersonal relationships between absent and cruel fathers, ambitious and emotionally demanding mothers, and sensitive children are understandable.",
        "article_id": 1
    },
    {
        "sentence_id": 36,
        "sentence": "From Eagleton's discussion of this novel, it seems that Paul has an Oedipus complex towards his mother, but he prefers his father over what he says himself.",
        "article_id": 1
    },
    {
        "sentence_id": 37,
        "sentence": "After this demonstration, Eagleton felt it necessary to refute all these amateur enthusiasts who \"dislike critics of the entire methodology and prefer to work with weak premonitions, intuition, and sudden perceptions\".",
        "article_id": 1
    },
    {
        "sentence_id": 38,
        "sentence": "He expressed regret for his free expression, stating that the sensory structure of life experience can be transformed into internal reactions based on habits and biases.",
        "article_id": 1
    },
    {
        "sentence_id": 39,
        "sentence": "Instead of 'boring theories' and controversial ideas.",
        "article_id": 1
    },
    {
        "sentence_id": 40,
        "sentence": "However, Eagleton's views on \"sons and lovers\" in the novel did not delve into the level of \"debate\".",
        "article_id": 1
    },
    {
        "sentence_id": 41,
        "sentence": "In fact, the bottom of most replicas now displays similar information.",
        "article_id": 1
    },
    {
        "sentence_id": 42,
        "sentence": "Critique and Ideology \"(1976),\" Marxism and Literary Theory \"(1976), and\" Revolutionary Critique \"(1981) are Eagleton's early works on the function of criticism.",
        "article_id": 1
    },
    {
        "sentence_id": 43,
        "sentence": "The most important of these are criticism and ideology.",
        "article_id": 1
    },
    {
        "sentence_id": 44,
        "sentence": "Eagleton claimed in the book that he laid the theoretical foundation for the British Marxist critical school.",
        "article_id": 1
    },
    {
        "sentence_id": 45,
        "sentence": "In the new Eagleton criticism, the structure of the work is no longer simply seen as a \"microcosm or ideological code\" like the early \"restorative Marxist critical form\".",
        "article_id": 1
    },
    {
        "sentence_id": 46,
        "sentence": "Ideology is not the 'truth' of a text.",
        "article_id": 1
    },
    {
        "sentence_id": 47,
        "sentence": "Text is a structure: it constructs an ideology and reconstructs it in a relatively autonomous way for reprocessing and reconstruction in aesthetic production, while the text itself is to some extent destroyed by the influence of ideology.",
        "article_id": 1
    },
    {
        "sentence_id": 48,
        "sentence": "In this destructive practice, texts face an ideology that is a relatively structured form that oppresses their unique values and relationships. It faces the \"specific logic\" that constitutes the production periphery of the text itself.",
        "article_id": 1
    },
    {
        "sentence_id": 49,
        "sentence": "These suggestions echo abstract concepts and weaken people's attention, but as far as we know, they cannot change the fact that Marxist critics are exploring how to infuse \"ideology\" into works of art.",
        "article_id": 1
    },
    {
        "sentence_id": 50,
        "sentence": "In the latter half of Critique and Ideology, Eagleton elaborates on his contemporary Marxist approach through a brief review of 19th century novels.",
        "article_id": 1
    },
    {
        "sentence_id": 51,
        "sentence": "Dickens' understanding of the social reality at that time went against his traditional 'bourgeois ethics'. George Eliot avoided the tragic contradictions of rural society. Conrad's attitude towards British imperialism was fundamentally contradictory.",
        "article_id": 1
    },
    {
        "sentence_id": 52,
        "sentence": "These ideas don't sound as novel or profound as previous theories.",
        "article_id": 1
    },
    {
        "sentence_id": 53,
        "sentence": "This may be because their development space is too small.",
        "article_id": 1
    },
    {
        "sentence_id": 54,
        "sentence": "Eagleton ultimately felt pressured to showcase how his literary methods were \"deepened and enriched\" through long-term research.",
        "article_id": 1
    },
    {
        "sentence_id": 55,
        "sentence": "The Rape of Clarissa \"is his work that separates his first theory book from his last theory book.",
        "article_id": 1
    },
    {
        "sentence_id": 56,
        "sentence": "Eagleton summarized in his early work \"Marxism and Literary Criticism\" that if we cannot connect past literature",
        "article_id": 1
    },
    {
        "sentence_id": 57,
        "sentence": "We have not fully realized our own position in the struggle against exploitation, so it is impossible to effectively change this situation.",
        "article_id": 1
    },
    {
        "sentence_id": 58,
        "sentence": "In the case of Clarissa's rape, he began to demonstrate how to use Richardson to achieve this goal.",
        "article_id": 1
    },
    {
        "sentence_id": 59,
        "sentence": "For Eagleton, Richardson's novel is a social document that showcases how an ambitious bourgeoisie is infected by the \"barbarism\" of the ruling class it seeks to overthrow.",
        "article_id": 1
    },
    {
        "sentence_id": 60,
        "sentence": "Both social classes urgently need the moderating effect of 'female values'.",
        "article_id": 1
    },
    {
        "sentence_id": 61,
        "sentence": "Clarissa embodies these female values.",
        "article_id": 1
    },
    {
        "sentence_id": 62,
        "sentence": "At present, this critical work aimed at becoming a mature model of Marxist criticism in Britain is actually just a very small book.",
        "article_id": 1
    },
    {
        "sentence_id": 63,
        "sentence": "The section specifically introducing Clarissa is only 50 pages long and has thick fonts.",
        "article_id": 1
    },
    {
        "sentence_id": 64,
        "sentence": "The first half of this book is not about Clarice.",
        "article_id": 1
    },
    {
        "sentence_id": 65,
        "sentence": "Palmer's fable is: \"The new class has won the respect and recognition of the old class with its charm and virtues.",
        "article_id": 1
    },
    {
        "sentence_id": 66,
        "sentence": "However, Pamela ultimately became a \"symbolic victim of conspiracy\" in the class alliance between the bourgeoisie and the aristocracy.",
        "article_id": 1
    },
    {
        "sentence_id": 67,
        "sentence": "As you may have read, Pamela does not fit Eagleton's description.",
        "article_id": 1
    },
    {
        "sentence_id": 68,
        "sentence": "For example, Pamela is not a 'suitable two-dimensional drawing function', she is not just a victim.",
        "article_id": 1
    },
    {
        "sentence_id": 69,
        "sentence": "Eagleton's conclusion is somewhat inconsistent, as Pamela represents a comic moment of an ambitious class, full of vitality, confidence, and like all comics, miraculously distancing herself from serious harm.",
        "article_id": 1
    },
    {
        "sentence_id": 70,
        "sentence": "This movie belongs to Eagleton.",
        "article_id": 1
    },
    {
        "sentence_id": 71,
        "sentence": "Pamela \"is Eagleton's comic that tells women that they were imprisoned for the benefit of the bourgeoisie.",
        "article_id": 1
    },
    {
        "sentence_id": 72,
        "sentence": "Clarissa is a cartoon that depicts women as victims of patriarchal oppression.",
        "article_id": 1
    },
    {
        "sentence_id": 73,
        "sentence": "Clarissa and Lovelace's family are her oppressors.",
        "article_id": 1
    },
    {
        "sentence_id": 74,
        "sentence": "The language of her society is one of the tools that oppresses her.",
        "article_id": 1
    },
    {
        "sentence_id": 75,
        "sentence": "She always obeys what is allowed, which is the imprint of her well-trained power obedience network.",
        "article_id": 1
    },
    {
        "sentence_id": 76,
        "sentence": "It is from this network that Lovelace attempts to liberate it so that he can print it through his own more sinister power network - a complex metaphor.",
        "article_id": 1
    },
    {
        "sentence_id": 77,
        "sentence": "Eagleton got a lot from W.",
        "article_id": 1
    },
    {
        "sentence_id": 78,
        "sentence": "Warner's deconstructionists have read Clarissa's book, and although Eagleton later showed a relaxed and cheerful personality, Warner was very eager to break Clarissa Lovelace's resistance.",
        "article_id": 1
    },
    {
        "sentence_id": 79,
        "sentence": "Warner did indeed expose his emotional issues quite impolitely, but he at least carefully studied some of the language strategies used by Lovelace and Clarissa in close proximity.",
        "article_id": 1
    },
    {
        "sentence_id": 80,
        "sentence": "Eagleton showed no signs of doing anything for himself.",
        "article_id": 1
    },
    {
        "sentence_id": 81,
        "sentence": "Eagleton believed that Lovelace was Clarissa's main oppressor.",
        "article_id": 1
    },
    {
        "sentence_id": 82,
        "sentence": "Her family motivation can be explained in Marxist class terms, but what is his motivation?",
        "article_id": 1
    },
    {
        "sentence_id": 83,
        "sentence": "The fact that Lovelace represents' upper class barbarism 'does not fully explain his behavior.",
        "article_id": 1
    },
    {
        "sentence_id": 84,
        "sentence": "However, Lovelace clearly pursues the 'yellow fantasy'.",
        "article_id": 1
    },
    {
        "sentence_id": 85,
        "sentence": "This is Freud's role.",
        "article_id": 1
    },
    {
        "sentence_id": 86,
        "sentence": "Eagleton searched for 'Don Juan Fantasia' for us and sent out some disjointed reports: due to concerns about the integrity of her 'penis', Lovelace was shocked by this unnamed threat to her gender and needed a Clarissa so that he could reunite with the lost penis and relieve her calm' castration '.",
        "article_id": 1
    },
    {
        "sentence_id": 87,
        "sentence": "Afterwards, Eagleton avoided further discussion of Lovelace.",
        "article_id": 1
    },
    {
        "sentence_id": 88,
        "sentence": "To achieve this, he must talk about the Clarissa he avoided.",
        "article_id": 1
    },
    {
        "sentence_id": 89,
        "sentence": "Then he must find out what has had such a devastating impact on everyone, because we cannot imagine Clarissa's pain, except for Lovelace's pain.",
        "article_id": 1
    },
    {
        "sentence_id": 90,
        "sentence": "Clarissa of Eagleton remains a tall portrait of an oppressed woman, an immortal young girl in distress.",
        "article_id": 1
    },
    {
        "sentence_id": 91,
        "sentence": "Considering this, Eagleton became increasingly angry about Lovelace's \"serious lack of adult sexual orientation\".",
        "article_id": 1
    },
    {
        "sentence_id": 92,
        "sentence": "He is a 'poor person' who occupies too many positions in the novel.",
        "article_id": 1
    },
    {
        "sentence_id": 93,
        "sentence": "Eagleton, like Warner, represents the tendency of modern critics to favor one side in Clarissa's worrying conflict.",
        "article_id": 1
    },
    {
        "sentence_id": 94,
        "sentence": "This itself is enough to prove how slow our society is in getting rid of its worst habits, and may even question its ability to do so.",
        "article_id": 1
    },
    {
        "sentence_id": 95,
        "sentence": "One of the Soviet critics quoted by Eagleton in \"Literary Theory\", Yuri Lothmann, believed that the greatest works are those that contain the most \"information\".",
        "article_id": 1
    },
    {
        "sentence_id": 96,
        "sentence": "Eagleton often quotes Brecht, who is the most outstanding among all Marxist writers, defining a valuable letter as' no longer old, trivial, or mediocre, no longer thought-provoking '.",
        "article_id": 1
    },
    {
        "sentence_id": 97,
        "sentence": "Clarissa has more information than Eagleton himself can find, which has nothing to do with Eagleton's' Marxism '.",
        "article_id": 1
    },
    {
        "sentence_id": 98,
        "sentence": "His practice did not even touch upon the more complex issues that Marxist literature may raise.",
        "article_id": 1
    },
    {
        "sentence_id": 99,
        "sentence": "Eagleton's critical ability has not yet developed.",
        "article_id": 1
    },
    {
        "sentence_id": 100,
        "sentence": "This can be seen from his early articles on Nameless Judas.",
        "article_id": 1
    },
    {
        "sentence_id": 101,
        "sentence": "In this book, he has not yet collected the equipment he currently uses to conceal his limitations as a critic, which is the combination of Marx and Freud.",
        "article_id": 1
    },
    {
        "sentence_id": 102,
        "sentence": "Eagleton quoted Hardy's own description of the novel, calling it a 'deadly war between mind and body'.",
        "article_id": 1
    },
    {
        "sentence_id": 103,
        "sentence": "Eagleton attempted to explain that the deadly war between \"body and mind\" should be interpreted as \"the war between the human spirit and the repressive body of stubborn society\" - \"Judas\" should be seen as a novel about social injustice.",
        "article_id": 1
    },
    {
        "sentence_id": 104,
        "sentence": "But Hardy's meaning is more specific than the war between Judah and society, referring to the disastrous relationship between Judah and women, especially Su.",
        "article_id": 1
    },
    {
        "sentence_id": 105,
        "sentence": "Eagleton avoided discussing Su's behavior.",
        "article_id": 1
    },
    {
        "sentence_id": 106,
        "sentence": "On the contrary, in a unique set of paraphrasing phrases, he expressed some left-wing praise from Hardy, praising him for documenting Su's \"emotional structure\" in a realistic \"opaque\" way:",
        "article_id": 1
    },
    {
        "sentence_id": 107,
        "sentence": "Her elusive complexity is partly due to her transcending herself and pointing out the chaotic and uncertain emotional structures that belong to the entire period.",
        "article_id": 1
    },
    {
        "sentence_id": 108,
        "sentence": "Therefore, her opaque and inconsistent character is not only a personal trait, but also cannot prove that Hardy did not fully understand these traits. It is precisely in its opacity and contradictions that it most clearly recognizes this and is most representative.",
        "article_id": 1
    },
    {
        "sentence_id": 109,
        "sentence": "But Hardy knew what had happened between Su and her beloved.",
        "article_id": 1
    },
    {
        "sentence_id": 110,
        "sentence": "Its contradictions are far from transparent, and every evasive answer has its reasons.",
        "article_id": 1
    },
    {
        "sentence_id": 111,
        "sentence": "Just like Clarissa later on, Eagleton never realized what it was.",
        "article_id": 1
    },
    {
        "sentence_id": 112,
        "sentence": "If literary theory is not based on literary reading, then it has no value.",
        "article_id": 1
    }
]