[
    {
        "sentence_id": 0,
        "sentence": "The critical function describes the rise and fall of British literary criticism.",
        "article_id": 3
    },
    {
        "sentence_id": 1,
        "sentence": "This is the conclusion of Terry Eagleton in his book \"Literary Theory,\" which describes the major trends in recent literary criticism.",
        "article_id": 3
    },
    {
        "sentence_id": 2,
        "sentence": "According to the 'critical function', modern criticism begins with 'the speaker and the audience', indicating an understanding of the new revolutionary society itself.",
        "article_id": 3
    },
    {
        "sentence_id": 3,
        "sentence": "Since then, there has been no consensus on the goals of our society.",
        "article_id": 3
    },
    {
        "sentence_id": 4,
        "sentence": "Therefore, the status of literary critics declined from Edison, the \"literary figure\" of the 19th century, to eventually become the world of the 20th century.",
        "article_id": 3
    },
    {
        "sentence_id": 5,
        "sentence": "At some point in the 19th century, critics began to increasingly divide within the literary \"treasure trove of common human wisdom,\" and those who returned to narrow their professional fields.",
        "article_id": 3
    },
    {
        "sentence_id": 6,
        "sentence": "This review is the latest important attempt to link well-trained discussions about individual actions with broader discussions about the development of society as a whole.",
        "article_id": 3
    },
    {
        "sentence_id": 7,
        "sentence": "However, in the long run, this does not establish a closer relationship between universities and the public, or even with students.",
        "article_id": 3
    },
    {
        "sentence_id": 8,
        "sentence": "Recently, the English department has employed a series of powerful literary theories to resist those who challenge the right to education.",
        "article_id": 3
    },
    {
        "sentence_id": 9,
        "sentence": "However, these challenges must continue.",
        "article_id": 3
    },
    {
        "sentence_id": 10,
        "sentence": "Eagleton believed that the challenge lies in Marxism.",
        "article_id": 3
    },
    {
        "sentence_id": 11,
        "sentence": "The only surprising aspect of the critical function is that Eagleton's evaluation of Edison is unique among critics, and Edison is hardly a creative figure.",
        "article_id": 3
    },
    {
        "sentence_id": 12,
        "sentence": "As Eagleton said, modern critics like Edison should become 'equal participants with readers whose views soften their common ground'.",
        "article_id": 3
    },
    {
        "sentence_id": 13,
        "sentence": "Eagleton is unsure if his views should be \"softened\" by modern critics, and readers' \"public opinion\" quickly senses this.",
        "article_id": 3
    },
    {
        "sentence_id": 14,
        "sentence": "Literary Theory \"is the largest of Eagleton's two recent books and serves as an observational guide for various contemporary critical schools, providing a simple way to remember their uniqueness.",
        "article_id": 3
    },
    {
        "sentence_id": 15,
        "sentence": "Eagleton collected all biases against his competitors' absurd behavior.",
        "article_id": 3
    },
    {
        "sentence_id": 16,
        "sentence": "As he said, because we live in an amateur world with feelings and experiences, it has proven to be very successful.",
        "article_id": 3
    },
    {
        "sentence_id": 17,
        "sentence": "He can really laugh at the cost of sacrificing everyone.",
        "article_id": 3
    },
    {
        "sentence_id": 18,
        "sentence": "The following is a description of the \"Levy\" school, compared to Deconstructionists: True English literary language is rich, complex, emotional, and unique, and the best poetry is one that looks like biting an apple when read aloud.",
        "article_id": 3
    },
    {
        "sentence_id": 19,
        "sentence": "This language of \"health\" and \"vitality\" is a product of civilization's \"rationalism\": it embodies a creative integrity lost in history.",
        "article_id": 3
    },
    {
        "sentence_id": 20,
        "sentence": "Deconstructivism restores traditional humanistic liberalism, which has always been a clear sign of subconscious calmness and indulgence in confused privilege.",
        "article_id": 3
    },
    {
        "sentence_id": 21,
        "sentence": "Deconstructionists' literature proves that language cannot be as boring as bars, but discussing its failures.",
        "article_id": 3
    },
    {
        "sentence_id": 22,
        "sentence": "Eagleton, like British Marxists, enjoys a privileged position. Fortunately, he was able to defeat everyone, which also makes it difficult for 'human liberalism' to resist as much as possible.",
        "article_id": 3
    },
    {
        "sentence_id": 23,
        "sentence": "Ultimately, society is a very beautiful, eternal, and cruel society, expressing a strong sense of 'citizen solidarity'.",
        "article_id": 3
    },
    {
        "sentence_id": 24,
        "sentence": "At a more formal moment, he expressed regret that this university has become a servant of \"consumer oriented rather than social values oriented\".",
        "article_id": 3
    },
    {
        "sentence_id": 25,
        "sentence": "The recognition of their crimes undoubtedly led to an increase in Eagleton's book consumption.",
        "article_id": 3
    },
    {
        "sentence_id": 26,
        "sentence": "Eagleton was a smart student in the 1960s who became a part of the university system through regular channels.",
        "article_id": 3
    },
    {
        "sentence_id": 27,
        "sentence": "There, he placed his ideas under the influence of the academy.",
        "article_id": 3
    },
    {
        "sentence_id": 28,
        "sentence": "He always has strong doubts about English, especially when reading carefully.",
        "article_id": 3
    },
    {
        "sentence_id": 29,
        "sentence": "In the last few chapters of literary theory, Eagleton's favorite literary style is to connect literature with the way we organize our lives together.",
        "article_id": 3
    },
    {
        "sentence_id": 30,
        "sentence": "This is the way of Marxism.",
        "article_id": 3
    },
    {
        "sentence_id": 31,
        "sentence": "However, Eagleton found that Marxist thought did not fully and satisfactorily encompass the reality of 'we live together' on the ground.",
        "article_id": 3
    },
    {
        "sentence_id": 32,
        "sentence": "It is cleverly referred to as' intimacy 'or' intimacy '.",
        "article_id": 3
    },
    {
        "sentence_id": 33,
        "sentence": "Therefore, he recently discovered Freud's usage: Freud is a science that liberates humanity from things that hinder the realization of happiness.",
        "article_id": 3
    },
    {
        "sentence_id": 34,
        "sentence": "In this regard, it is similar to radical politics.",
        "article_id": 3
    },
    {
        "sentence_id": 35,
        "sentence": "Eagleton analyzed how Freud and Marx got along in his book \"Sons and Lovers\": we can discuss the \"weaknesses\" of Paul's father image and the \"strengths\" of his mother image from the perspectives of Oedipus and class. From the perspective of subconscious processes, social forces, and relationships, we can see that the personal relationships between absent and violent fathers, ambitious and emotional mothers, and sensitive children are understandable.",
        "article_id": 3
    },
    {
        "sentence_id": 36,
        "sentence": "In discussing the novel of Eagleton, Paul seems to be Oedipus to his mother, but he prefers his father over what he says himself.",
        "article_id": 3
    },
    {
        "sentence_id": 37,
        "sentence": "After this performance, Iglen felt qualified to refute all amateur enthusiasts, \"Those critics who don't like the entire methodology, they prefer to work with poor intuition and sudden perception",
        "article_id": 3
    },
    {
        "sentence_id": 38,
        "sentence": "He expressed regret for the loss of wording and stated that the sensory structure of life experience can be transformed into internal reactions based on habits and biases.",
        "article_id": 3
    },
    {
        "sentence_id": 39,
        "sentence": "Instead of 'boring theories' and controversial ideas.",
        "article_id": 3
    },
    {
        "sentence_id": 40,
        "sentence": "However, Egerton's viewpoint in the novel is not profound enough and is not worth debating.",
        "article_id": 3
    },
    {
        "sentence_id": 41,
        "sentence": "In fact, most replicas now display similar information on the back cover.",
        "article_id": 3
    },
    {
        "sentence_id": 42,
        "sentence": "Critique and Thought (1976), Marxism and Literary Theory (1976), and Walter Benjamin's Towards Revolution (1981) are Eagleton's early works on the function of criticism.",
        "article_id": 3
    },
    {
        "sentence_id": 43,
        "sentence": "The most important of these criticisms and ideologies is.",
        "article_id": 3
    },
    {
        "sentence_id": 44,
        "sentence": "Eagleton claimed in his book that he laid the theoretical foundation of British Marxism for the critical school.",
        "article_id": 3
    },
    {
        "sentence_id": 45,
        "sentence": "In Eagleton's novels, the criticism of work structure is no longer just a \"small world or symbol of thought\" like in the early days of Marxist criticism.",
        "article_id": 3
    },
    {
        "sentence_id": 46,
        "sentence": "Thought is not the 'truth' in text.",
        "article_id": 3
    },
    {
        "sentence_id": 47,
        "sentence": "Text is a structure: it constructs ideas in order to reconstruct them in a relatively independent way, in order to process and reconstruct them in aesthetic production, and the text itself is destroyed to varying degrees due to the influence of ideas.",
        "article_id": 3
    },
    {
        "sentence_id": 48,
        "sentence": "In this destructive practice, text may encounter ideas, which are a relatively structured form that compresses unique values and relationships. It faces the 'tangible logic' that forms the outline of the text itself.",
        "article_id": 3
    },
    {
        "sentence_id": 49,
        "sentence": "These sentences echo abstract concepts and weaken people's interest, but as we all know, none of these have changed the fact that Marxist criticism explores the way \"ideas\" enter works of art.",
        "article_id": 3
    },
    {
        "sentence_id": 50,
        "sentence": "In the latter half of Critique and Doctrine, Eagleton explains to him the methods of modern Marxism by summarizing 19th century novels.",
        "article_id": 3
    },
    {
        "sentence_id": 51,
        "sentence": "Dickens' understanding of the social reality at that time was contradictory to the traditional 'bourgeois morality'. George Elliott avoided the tragic contradictions of rural society. Conrad's attitude towards British imperialism was fundamentally contradictory.",
        "article_id": 3
    },
    {
        "sentence_id": 52,
        "sentence": "These ideas don't seem as fresh or profound as previous theories.",
        "article_id": 3
    },
    {
        "sentence_id": 53,
        "sentence": "But perhaps this is because its development space is very small.",
        "article_id": 3
    },
    {
        "sentence_id": 54,
        "sentence": "Egton ultimately felt the pressure of a long-term study that showed how literary methods can be 'deepened and enriched'.",
        "article_id": 3
    },
    {
        "sentence_id": 55,
        "sentence": "The Clarissa rape case is a work that distinguishes the first theory book from another theory book.",
        "article_id": 3
    },
    {
        "sentence_id": 56,
        "sentence": "Eagleton pointed out in his previous work \"Marxism and Literary Criticism\" that unless we can connect the past with literature.",
        "article_id": 3
    },
    {
        "sentence_id": 57,
        "sentence": "We do not fully understand our situation in combating male and female exploitation, so we are unlikely to effectively change this situation.",
        "article_id": 3
    },
    {
        "sentence_id": 58,
        "sentence": "In \"The Clarissa Rape Case,\" he begins to demonstrate how to use Richardson to achieve this goal.",
        "article_id": 3
    },
    {
        "sentence_id": 59,
        "sentence": "For Eagleton, Richardson is a social literature that showcases how the ambitions of the bourgeoisie are harmed by the \"brutality\" of the ruling class attempting to overthrow him.",
        "article_id": 3
    },
    {
        "sentence_id": 60,
        "sentence": "All social classes urgently need to soften their 'female values'.",
        "article_id": 3
    },
    {
        "sentence_id": 61,
        "sentence": "Clarissa embodies these female values.",
        "article_id": 3
    },
    {
        "sentence_id": 62,
        "sentence": "This ongoing critical work aims to become a mature model of Marxist criticism in the UK, and is actually a very small book.",
        "article_id": 3
    },
    {
        "sentence_id": 63,
        "sentence": "Clarissa is part of the on-site discussion, only 50 pages long and with thick fonts.",
        "article_id": 3
    },
    {
        "sentence_id": 64,
        "sentence": "The first half of this book is not about Clarissa at all.",
        "article_id": 3
    },
    {
        "sentence_id": 65,
        "sentence": "This is Pamela's proverb, \"The new class with charm and virtue gains the respect and acceptance of the old class",
        "article_id": 3
    },
    {
        "sentence_id": 66,
        "sentence": "However, in the end, Pamela became a symbol of the \"victims of conspiracy\" in the alliance between the bourgeoisie and the aristocracy.",
        "article_id": 3
    },
    {
        "sentence_id": 67,
        "sentence": "As you may have read, Pamela does not fit Eagleton's description.",
        "article_id": 3
    },
    {
        "sentence_id": 68,
        "sentence": "(B) For example, Pamela is not a 'suitable 2D position', she is not just his victim.",
        "article_id": 3
    },
    {
        "sentence_id": 69,
        "sentence": "Eagleton arrived at contradictory conclusions, as Pamela represented the ambition of the comedy class, and of course, like all comics, miraculously avoided serious harm.",
        "article_id": 3
    },
    {
        "sentence_id": 70,
        "sentence": "The animated movie 'Eagleton'.",
        "article_id": 3
    },
    {
        "sentence_id": 71,
        "sentence": "Pamela is the protagonist of 'Eagleton Cartoon', which tells the story of women enslaved by the bourgeoisie.",
        "article_id": 3
    },
    {
        "sentence_id": 72,
        "sentence": "Clarissa is a comedian about female victims of parental oppression.",
        "article_id": 3
    },
    {
        "sentence_id": 73,
        "sentence": "The Clarissa Lovelace family is an oppressor.",
        "article_id": 3
    },
    {
        "sentence_id": 74,
        "sentence": "Social language is one of the tools of repression.",
        "article_id": 3
    },
    {
        "sentence_id": 75,
        "sentence": "They always obey allowed words, which is a sign of well-trained obedience to the network.",
        "article_id": 3
    },
    {
        "sentence_id": 76,
        "sentence": "It is from this network that Lovelace attempts to liberate it so that it can be printed out through a more sinister power network, which is a complex measurement.",
        "article_id": 3
    },
    {
        "sentence_id": 77,
        "sentence": "Eagleton received a lot of w.",
        "article_id": 3
    },
    {
        "sentence_id": 78,
        "sentence": "Warner Deconstructionists read Clarissa's work, and although later Eagleton showed relaxation and enjoyment, Warner yearned to shatter Clarissa's resistance to Lovelace.",
        "article_id": 3
    },
    {
        "sentence_id": 79,
        "sentence": "Warner did not disclose his emotional issues, but at least he carefully studied some of the language strategies used by Lovelace and Clarissa.",
        "article_id": 3
    },
    {
        "sentence_id": 80,
        "sentence": "Eagleton showed no signs of doing this for himself.",
        "article_id": 3
    },
    {
        "sentence_id": 81,
        "sentence": "Eagleton believed that Lovelace was the main persecutor of Clarissa.",
        "article_id": 3
    },
    {
        "sentence_id": 82,
        "sentence": "Her family motivation can be explained by Marxist class, but what is the motivation?",
        "article_id": 3
    },
    {
        "sentence_id": 83,
        "sentence": "The fact that Lovelace represents the 'barbaric upper class' does not fully explain his actions.",
        "article_id": 3
    },
    {
        "sentence_id": 84,
        "sentence": "However, Lovelace was clearly troubled by the 'yellow fantasy'.",
        "article_id": 3
    },
    {
        "sentence_id": 85,
        "sentence": "This is where Freud worked.",
        "article_id": 3
    },
    {
        "sentence_id": 86,
        "sentence": "Eagleton searched for 'Tanghuang Fantasy' for us and sent a somewhat disjointed report: she was worried about the safety of her 'penis', shaken by unidentified individuals threatening her gender, and Lovelace must be Clarissa so he could reunite them with the lost penis and show her a reassuring headscarf' castration '.",
        "article_id": 3
    },
    {
        "sentence_id": 87,
        "sentence": "Later, Egton avoided further discussions with Lovelace.",
        "article_id": 3
    },
    {
        "sentence_id": 88,
        "sentence": "To achieve this goal, we must talk about Clarissa, whom we have been avoiding.",
        "article_id": 3
    },
    {
        "sentence_id": 89,
        "sentence": "Then you must discover what has had such a devastating impact on everyone, because apart from Lovelace's suffering, we cannot imagine Clarissa's suffering.",
        "article_id": 3
    },
    {
        "sentence_id": 90,
        "sentence": "Clarissa Egerton remains a noble image of an oppressed woman, a predicament of an immortal girl.",
        "article_id": 3
    },
    {
        "sentence_id": 91,
        "sentence": "When contemplating this issue, Eagleton Lovelace became increasingly angry about his severe lack of adult sexual ability.",
        "article_id": 3
    },
    {
        "sentence_id": 92,
        "sentence": "He is a 'poor man' who occupies a lot of space in the novel.",
        "article_id": 3
    },
    {
        "sentence_id": 93,
        "sentence": "Like Warner, Eagleton represents the modern trend of critics on one side of Clarissa's unsettling conflict.",
        "article_id": 3
    },
    {
        "sentence_id": 94,
        "sentence": "This itself is enough to prove how slow our society is in getting rid of its worst habits, and may even question its ability to do so.",
        "article_id": 3
    },
    {
        "sentence_id": 95,
        "sentence": "Yuri Lothmann, a Soviet critic of Eagleton's literary theory, believed that the greatest works are those that contain the majority of \"information\".",
        "article_id": 3
    },
    {
        "sentence_id": 96,
        "sentence": "Eagleton is often regarded by Brecht as the most outstanding Marxist writer, who knows the value of writing, 'no longer worn out, trivial, or humble, no longer thinking'.",
        "article_id": 3
    },
    {
        "sentence_id": 97,
        "sentence": "Clarissa has more information than Eagleton, and she can find that she has nothing to do with \"Marxist\" Eagleton.",
        "article_id": 3
    },
    {
        "sentence_id": 98,
        "sentence": "His practice did not solve more complex problems than those that may arise in Marxist literature.",
        "article_id": 3
    },
    {
        "sentence_id": 99,
        "sentence": "The ability of critic Eagleton has not yet developed.",
        "article_id": 3
    },
    {
        "sentence_id": 100,
        "sentence": "Looking back at his previous articles on the existence of ambiguity, this can be seen.",
        "article_id": 3
    },
    {
        "sentence_id": 101,
        "sentence": "In this book, he states that the equipment he currently uses has not been assembled to conceal his limitations as a critic, namely the combination of Marx and Freud.",
        "article_id": 3
    },
    {
        "sentence_id": 102,
        "sentence": "Eagleton quoted Hardy himself as saying that this novel is a 'deadly war between mind and body'.",
        "article_id": 3
    },
    {
        "sentence_id": 103,
        "sentence": "Eagleton is keen to explain that this deadly war between the body and soul should be interpreted as a \"war between human thought and the body that impedes stubborn society\" - Judas should be seen as a novel about social injustice.",
        "article_id": 3
    },
    {
        "sentence_id": 104,
        "sentence": "But Hardy pointed out more specific things than going to war with society, and pointed out the disastrous relationship with women, especially Su.",
        "article_id": 3
    },
    {
        "sentence_id": 105,
        "sentence": "Eagleton avoided discussing Su's behavior.",
        "article_id": 3
    },
    {
        "sentence_id": 106,
        "sentence": "On the contrary, in a series of unique echo phrases, he expressed some praise for the hard left hand, praising his \"fuzzy\" realism and \"Su's scoring style\" emotional structure:",
        "article_id": 3
    },
    {
        "sentence_id": 107,
        "sentence": "Its elusive complexity partly stems from transcending itself, referring to the chaotic and ambiguous emotional structure of the entire period.",
        "article_id": 3
    },
    {
        "sentence_id": 108,
        "sentence": "Therefore, the ambiguity and inconsistency of its role not only constitute personal characteristics, but also cannot prove that Hardy was not fully aware of these characteristics; this includes more conscious and representative ambiguity and contradictions.",
        "article_id": 3
    },
    {
        "sentence_id": 109,
        "sentence": "But Hardy knew exactly what had happened between Su and the man who loved her.",
        "article_id": 3
    },
    {
        "sentence_id": 110,
        "sentence": "Its contradictions are far from ambiguous, and every response to it has its reasons.",
        "article_id": 3
    },
    {
        "sentence_id": 111,
        "sentence": "Like Clarissa later on, Eagleton did not discover what it was.",
        "article_id": 3
    },
    {
        "sentence_id": 112,
        "sentence": "If literary theory is not based on literary reading, then it is worthless.",
        "article_id": 3
    }
]