[
    {
        "sentence_id": 0,
        "sentence": "The function of criticism describes the rise and fall of British literary criticism.",
        "article_id": 0
    },
    {
        "sentence_id": 1,
        "sentence": "It constitutes the postscript to Terry Eagleton's previous book \"Literary Theory,\" which describes the major trends in recent literary criticism.",
        "article_id": 0
    },
    {
        "sentence_id": 2,
        "sentence": "According to \"The Function of Criticism,\" modern criticism began with \"The Speaker and the Spectator,\" expressing a revolutionary new society's understanding of itself.",
        "article_id": 0
    },
    {
        "sentence_id": 3,
        "sentence": "Since then, there has been no similar consensus on the goals of our society.",
        "article_id": 0
    },
    {
        "sentence_id": 4,
        "sentence": "Therefore, the status of literary critics declined from Edison to the \"literary figure\" of the 19th century, and ultimately became scholars of the 20th century.",
        "article_id": 0
    },
    {
        "sentence_id": 5,
        "sentence": "At some point in the 19th century, there began to be a divergence between critics who increasingly viewed literature as a \"treasure trove of common human wisdom\" and those who retreated into increasingly narrow fields of expertise.",
        "article_id": 0
    },
    {
        "sentence_id": 6,
        "sentence": "Censorship is the last important attempt to link well-trained discussions on individual works with broader discussions on the development of society as a whole.",
        "article_id": 0
    },
    {
        "sentence_id": 7,
        "sentence": "But in the long run, this has not established closer connections between universities and the larger public, or even with their own students.",
        "article_id": 0
    },
    {
        "sentence_id": 8,
        "sentence": "Recently, the English department has been blocking itself behind a series of powerful literary theories to resist those who challenge their teaching rights.",
        "article_id": 0
    },
    {
        "sentence_id": 9,
        "sentence": "However, these challenges must continue.",
        "article_id": 0
    },
    {
        "sentence_id": 10,
        "sentence": "The challenge that Eagleton thought of was Marxist.",
        "article_id": 0
    },
    {
        "sentence_id": 11,
        "sentence": "The only surprising aspect of 'The Function of Criticism' is that Eagleton's evaluation of Addison is unique among critics, and Addison is hardly an imaginative character.",
        "article_id": 0
    },
    {
        "sentence_id": 12,
        "sentence": "As Eagleton said, modern critics should be like Addison, becoming 'equal co discussants with the reader community, whose views are softened by their common views'.",
        "article_id": 0
    },
    {
        "sentence_id": 13,
        "sentence": "Eagleton is not sure which viewpoints he believes should be \"softened\" by a modern critic who has a \"quick sense\" of the reader's \"general opinion\".",
        "article_id": 0
    },
    {
        "sentence_id": 14,
        "sentence": "Literary Theory \"is the larger of Eagleton's two recent books and serves as an observational guide for various contemporary critical schools, providing a simple way to remember their unique features.",
        "article_id": 0
    },
    {
        "sentence_id": 15,
        "sentence": "Eagleton collected biases from each group against their competitors' absurd behavior.",
        "article_id": 0
    },
    {
        "sentence_id": 16,
        "sentence": "As he himself said, because we live in a world of amateur common sense and professional knowledge, this has proven to be quite successful.",
        "article_id": 0
    },
    {
        "sentence_id": 17,
        "sentence": "He can really be funny at the cost of sacrificing everyone's interests.",
        "article_id": 0
    },
    {
        "sentence_id": 18,
        "sentence": "Here is his description of the \"Leavism School\" compared to deconstructionists: True English literature is rich, complex, emotional, and unique in language, and the best poetry, to put it mildly ironic, is the kind of poetry that sounds like chewing an apple when read aloud.",
        "article_id": 0
    },
    {
        "sentence_id": 19,
        "sentence": "The \"health\" and \"vitality\" of this language are products of a \"rational\" civilization: it embodies a creative wholeness that has been lost in history, so reading literature is to reconnect with one's roots.",
        "article_id": 0
    },
    {
        "sentence_id": 20,
        "sentence": "Deconstructionism has reintroduced traditional liberal humanism, whose calm indulgence in one's own confusion is always a clear sign of unconscious privilege.",
        "article_id": 0
    },
    {
        "sentence_id": 21,
        "sentence": "The literary proof of deconstructionists is that language cannot be like the boredom in a bar, only discussing one's own failures.",
        "article_id": 0
    },
    {
        "sentence_id": 22,
        "sentence": "Eagleton's privileged position as a British Marxist allowed him to happily beat everyone in front of him, and he also made it as difficult as possible for 'liberal humanists' to counterattack.",
        "article_id": 0
    },
    {
        "sentence_id": 23,
        "sentence": "The ultimate society he envisioned sounds very pleasant, an eternal and cruel society, expressing a strong sense of 'civilian unity'.",
        "article_id": 0
    },
    {
        "sentence_id": 24,
        "sentence": "In his more solemn moments, he lamented that universities had become servants of a \"consumer oriented society rather than a value oriented society\".",
        "article_id": 0
    },
    {
        "sentence_id": 25,
        "sentence": "The repentance for their crimes is certainly their further consumption of Eagleton's books.",
        "article_id": 0
    },
    {
        "sentence_id": 26,
        "sentence": "Eagleton was a smart student in the 1960s who integrated into the university system through the usual channels.",
        "article_id": 0
    },
    {
        "sentence_id": 27,
        "sentence": "There, he developed his ideas into an influential academic profession.",
        "article_id": 0
    },
    {
        "sentence_id": 28,
        "sentence": "He always maintains a strong skepticism towards \"English\", especially \"close reading\".",
        "article_id": 0
    },
    {
        "sentence_id": 29,
        "sentence": "The last few sections of \"Literary Theory\" promote Eagleton's own favorite literary method, which links literature with \"the way we organize our lives together\".",
        "article_id": 0
    },
    {
        "sentence_id": 30,
        "sentence": "This is the method of Marxism.",
        "article_id": 0
    },
    {
        "sentence_id": 31,
        "sentence": "However, Eagleton found that Marxist thought did not fully and satisfactorily cover a field of 'we live together'.",
        "article_id": 0
    },
    {
        "sentence_id": 32,
        "sentence": "He subtly referred to it as the 'intimate realm' or 'intimate area'.",
        "article_id": 0
    },
    {
        "sentence_id": 33,
        "sentence": "It is here that he recently discovered Freud's usefulness: Freudianism is a science dedicated to liberating humanity from things that hinder its realization and happiness.",
        "article_id": 0
    },
    {
        "sentence_id": 34,
        "sentence": "In this regard, it shares similarities with radical politics.",
        "article_id": 0
    },
    {
        "sentence_id": 35,
        "sentence": "Eagleton analyzed how Freud and Marx got along in his five page book \"Sons and Lovers\": we can discuss Paul's \"weak\" image of his father and his \"strong\" image of his mother from the perspectives of Oedipus and class; We can see that the interpersonal relationships between an absent and violent father, an ambitious and emotionally demanding mother, and a sensitive child are understandable, both from the perspective of unconscious processes and certain social forces and relationships.",
        "article_id": 0
    },
    {
        "sentence_id": 36,
        "sentence": "From Eagleton's discussion of this novel, it appears that Paul does have an Oedipus complex towards his mother, but he prefers his father over what he tells himself.",
        "article_id": 0
    },
    {
        "sentence_id": 37,
        "sentence": "After this demonstration, Eagleton felt qualified to refute all those amateur \"critics who dislike the entire methodology and prefer to work with weak premonitions, intuition, and sudden perceptions\".",
        "article_id": 0
    },
    {
        "sentence_id": 38,
        "sentence": "He expressed regret for their loose wording, stating that the sensory structure of life experience can be translated into reactions made from the heart based on habits and biases.",
        "article_id": 0
    },
    {
        "sentence_id": 39,
        "sentence": "Instead of 'dry theories' and controversial ideas.",
        "article_id": 0
    },
    {
        "sentence_id": 40,
        "sentence": "But Eagleton's views on \"Sons and Lovers\" did not go far enough in the novel and are not worth \"debating\" at all.",
        "article_id": 0
    },
    {
        "sentence_id": 41,
        "sentence": "In fact, most replicas now display similar information on the back cover.",
        "article_id": 0
    },
    {
        "sentence_id": 42,
        "sentence": "Criticism and Ideology \"(1976),\" Marxism and Literary Theory \"(1976), and Walter Benjamin's\" Towards Revolutionary Criticism \"(1981) are Eagleton's early works on the function of criticism.",
        "article_id": 0
    },
    {
        "sentence_id": 43,
        "sentence": "The most important of these are criticism and ideology.",
        "article_id": 0
    },
    {
        "sentence_id": 44,
        "sentence": "Eagleton claimed in the book that he laid the theoretical foundation for the British Marxist critical school.",
        "article_id": 0
    },
    {
        "sentence_id": 45,
        "sentence": "In the new, Eagleton style criticism, the structure of the work is no longer simply seen as a \"microcosm or code of ideology\" like earlier, more \"reductionist\" forms of Marxist criticism.",
        "article_id": 0
    },
    {
        "sentence_id": 46,
        "sentence": "Ideology is not the 'truth' of a text.",
        "article_id": 0
    },
    {
        "sentence_id": 47,
        "sentence": "Text constitutes a structure: it constructs ideology in order to reconstruct it in a relatively autonomous way, in order to process and reshape it in aesthetic production, while itself is also subject to varying degrees of destruction due to the influence of ideology.",
        "article_id": 0
    },
    {
        "sentence_id": 48,
        "sentence": "In this destructive practice, the text encounters ideology, which is a relatively structured form that presses upon its own unique values and relationships. It faces a 'concrete logic' that constitutes the periphery of the text's own production.",
        "article_id": 0
    },
    {
        "sentence_id": 49,
        "sentence": "These sentences echo abstract concepts and weaken people's attention, but as far as people can understand, none of this changes the fact that Marxist criticism explores the way \"ideology\" enters works of art.",
        "article_id": 0
    },
    {
        "sentence_id": 50,
        "sentence": "In the latter half of Critique and Ideology, Eagleton elaborates on his modern Marxist approach through a brief overview of 19th century novels.",
        "article_id": 0
    },
    {
        "sentence_id": 51,
        "sentence": "Dickens' understanding of the social reality at that time conflicted with his traditional 'bourgeois ethics'; George Eliot avoided the tragic contradictions that existed in her rural society; Conrad's attitude towards British imperialism is fundamentally contradictory.",
        "article_id": 0
    },
    {
        "sentence_id": 52,
        "sentence": "These insights do not sound as novel or profound as previous theories.",
        "article_id": 0
    },
    {
        "sentence_id": 53,
        "sentence": "But perhaps this is because their development space is too small.",
        "article_id": 0
    },
    {
        "sentence_id": 54,
        "sentence": "Eagleton ultimately felt pressured to showcase in a lengthy study how his literary methods were 'deepened and enriched'.",
        "article_id": 0
    },
    {
        "sentence_id": 55,
        "sentence": "Clarissa's Rape \"is a work that separates his first theoretical books from his most recent.",
        "article_id": 0
    },
    {
        "sentence_id": 56,
        "sentence": "Eagleton summarized in his early work \"Marxism and Literary Criticism\" that unless we can connect past literature...",
        "article_id": 0
    },
    {
        "sentence_id": 57,
        "sentence": "We do not fully understand our own situation regarding the struggle between men and women against exploitation, and therefore it is unlikely to effectively change it.",
        "article_id": 0
    },
    {
        "sentence_id": 58,
        "sentence": "In the Clarissa Rape case, he began to demonstrate how to use Richardson to achieve this.",
        "article_id": 0
    },
    {
        "sentence_id": 59,
        "sentence": "For Eagleton, Richardson's novel is a social document that showcases how an ambitious bourgeoisie is infected by the \"barbarism\" of the ruling class it seeks to overthrow.",
        "article_id": 0
    },
    {
        "sentence_id": 60,
        "sentence": "Both social classes urgently need the softening effect of 'female values'.",
        "article_id": 0
    },
    {
        "sentence_id": 61,
        "sentence": "Clarissa embodies these female values.",
        "article_id": 0
    },
    {
        "sentence_id": 62,
        "sentence": "This ongoing critical work aimed at becoming a mature model of Marxist criticism in Britain is actually a very small book.",
        "article_id": 0
    },
    {
        "sentence_id": 63,
        "sentence": "The section directly discussing Clarissa is only fifty pages long and the font is quite bold.",
        "article_id": 0
    },
    {
        "sentence_id": 64,
        "sentence": "The first half of this book is not about Clarissa at all.",
        "article_id": 0
    },
    {
        "sentence_id": 65,
        "sentence": "It is about Pamela - as a fable, 'the new class won the respect and acceptance of the old class with its charm and virtues'.",
        "article_id": 0
    },
    {
        "sentence_id": 66,
        "sentence": "However, in the end, Pamela became a \"symbolic victim of conspiracy\" in the class alliance being established between the bourgeoisie and the aristocracy.",
        "article_id": 0
    },
    {
        "sentence_id": 67,
        "sentence": "As you may know while reading, Pamela does not fit Eagleton's description of it.",
        "article_id": 0
    },
    {
        "sentence_id": 68,
        "sentence": "B、  For example, Pamela is not \"a proper two-dimensional plotting function,\" and she is not just his victim.",
        "article_id": 0
    },
    {
        "sentence_id": 69,
        "sentence": "Eagleton's conclusion is somewhat inconsistent, as Pamela represents a comedic moment of an ambitious class, lively, affirmative, and like all comics, miraculously distancing herself from serious harm.",
        "article_id": 0
    },
    {
        "sentence_id": 70,
        "sentence": "This animated film is by Eagleton.",
        "article_id": 0
    },
    {
        "sentence_id": 71,
        "sentence": "Pamela \"is a comic by Eagleton that tells the story of women as pawns in the interests of the bourgeoisie.",
        "article_id": 0
    },
    {
        "sentence_id": 72,
        "sentence": "Clarissa is a comic about women as victims of patriarchal oppression.",
        "article_id": 0
    },
    {
        "sentence_id": 73,
        "sentence": "Clarissa's family and Lovelace are her oppressors.",
        "article_id": 0
    },
    {
        "sentence_id": 74,
        "sentence": "The language of her society is one of the tools that oppresses her.",
        "article_id": 0
    },
    {
        "sentence_id": 75,
        "sentence": "She has always been obedient to permissible words, imprinted by her trained power network of obedience.",
        "article_id": 0
    },
    {
        "sentence_id": 76,
        "sentence": "It was from this network that Lovelace attempted to liberate her so that he could print her through his own more sinister power network - a tangled metaphor.",
        "article_id": 0
    },
    {
        "sentence_id": 77,
        "sentence": "Eagleton got a lot from W.",
        "article_id": 0
    },
    {
        "sentence_id": 78,
        "sentence": "Warner's deconstructionists read Clarissa, although Eagleton later displayed a relaxed and cheerful personality at the expense of Warner's strong desire to crush Clarissa's resistance to Lovelace.",
        "article_id": 0
    },
    {
        "sentence_id": 79,
        "sentence": "Warner did indeed expose his emotional issues quite lewdly, but he at least carefully studied some of the language strategies used by Lovelace and Clarissa in close proximity.",
        "article_id": 0
    },
    {
        "sentence_id": 80,
        "sentence": "Eagleton showed no signs of doing this for himself.",
        "article_id": 0
    },
    {
        "sentence_id": 81,
        "sentence": "Eagleton believed that Lovelace was Clarissa's main oppressor.",
        "article_id": 0
    },
    {
        "sentence_id": 82,
        "sentence": "Her family motivation can be explained in Marxist class terms, but what is his motivation?",
        "article_id": 0
    },
    {
        "sentence_id": 83,
        "sentence": "The fact that Lovelace represents' upper class barbarism 'does not fully explain his behavior.",
        "article_id": 0
    },
    {
        "sentence_id": 84,
        "sentence": "However, Lovelace was clearly troubled by the 'Don Huang fantasy'.",
        "article_id": 0
    },
    {
        "sentence_id": 85,
        "sentence": "This is where Freud came into play.",
        "article_id": 0
    },
    {
        "sentence_id": 86,
        "sentence": "Eagleton searched for 'Don Huang Fantasy' for us and sent back a somewhat incoherent report: frightened by the integrity of her 'phallus', shaken by this unnamed threat to her gender, Lovelace must possess Clarissa so that he can reunite with the lost phallus and uncover her reassuring veil of' castration '.",
        "article_id": 0
    },
    {
        "sentence_id": 87,
        "sentence": "Afterwards, Eagleton avoided further discussion of Lovelace.",
        "article_id": 0
    },
    {
        "sentence_id": 88,
        "sentence": "To achieve this, he must talk about Clarissa, whom he has been avoiding.",
        "article_id": 0
    },
    {
        "sentence_id": 89,
        "sentence": "Then, he must discover what has had such a devastating impact on each person, because apart from Lovelace's pain, we cannot imagine Clarissa's pain.",
        "article_id": 0
    },
    {
        "sentence_id": 90,
        "sentence": "Clarissa of Eagleton remains a noble image of an oppressed woman, an immortal young girl in distress.",
        "article_id": 0
    },
    {
        "sentence_id": 91,
        "sentence": "As he pondered this matter, Eagleton became increasingly indignant about Lovelace's \"severe lack of adult sexual ability\".",
        "article_id": 0
    },
    {
        "sentence_id": 92,
        "sentence": "He is a 'pitiful character' who occupies too much space in the novel.",
        "article_id": 0
    },
    {
        "sentence_id": 93,
        "sentence": "Eagleton, like Warner, represents the tendency of modern critics to favor one side in Clarissa's unsettling conflict.",
        "article_id": 0
    },
    {
        "sentence_id": 94,
        "sentence": "This itself is enough to prove how slowly our society actually gets rid of the worst habits, and may even question its ability to do so.",
        "article_id": 0
    },
    {
        "sentence_id": 95,
        "sentence": "One of the Soviet critics quoted by Eagleton in \"Literary Theory\", Yuri Lothmann, believed that the greatest works are those that contain the most \"information\".",
        "article_id": 0
    },
    {
        "sentence_id": 96,
        "sentence": "Eagleton often quotes Brecht as the most outstanding among all Marxist writers, defining valuable writing as \"not worn out, trivial, or commonplace, no longer thought-provoking\".",
        "article_id": 0
    },
    {
        "sentence_id": 97,
        "sentence": "Clarissa has more information than Eagleton can find on her own, which has little to do with Eagleton's' Marxism '.",
        "article_id": 0
    },
    {
        "sentence_id": 98,
        "sentence": "His practice did not even touch upon the more complex issues that Marxist literature could raise.",
        "article_id": 0
    },
    {
        "sentence_id": 99,
        "sentence": "Eagleton's ability as a critic has not yet developed.",
        "article_id": 0
    },
    {
        "sentence_id": 100,
        "sentence": "Looking back at his early article about Jude the Obscure, this can be seen.",
        "article_id": 0
    },
    {
        "sentence_id": 101,
        "sentence": "In this book, he has not yet assembled the device he currently uses to conceal his limitations as a critic, namely the combination of Marx and Freud.",
        "article_id": 0
    },
    {
        "sentence_id": 102,
        "sentence": "Eagleton quoted Hardy's own description of the novel, calling it a 'deadly war between the body and the mind'.",
        "article_id": 0
    },
    {
        "sentence_id": 103,
        "sentence": "Eagleton was eager to explain that this deadly war between \"body and spirit\" should be interpreted as a \"war between the human spirit and the obstructive body of stubborn society\" - \"Judas\" should be seen as a novel about social injustice.",
        "article_id": 0
    },
    {
        "sentence_id": 104,
        "sentence": "But Hardy refers to more specific things than Jude's war with society, he refers to Jude's disastrous relationship with women, especially Sue.",
        "article_id": 0
    },
    {
        "sentence_id": 105,
        "sentence": "Eagleton avoided talking about Su's behavior.",
        "article_id": 0
    },
    {
        "sentence_id": 106,
        "sentence": "On the contrary, in a series of distinctive echoing phrases, he expressed some left-handed praise for Hardy, praising him for recording Su's \"emotional structure\" in a realistic \"opaque\" way:.",
        "article_id": 0
    },
    {
        "sentence_id": 107,
        "sentence": "Her elusive complexity partly stems from the fact that she transcends herself and points to a chaotic and ambiguous emotional structure that belongs to the entire period.",
        "article_id": 0
    },
    {
        "sentence_id": 108,
        "sentence": "Therefore, her opacity and inconsistency as a character are not just personal traits, nor evidence of Hardy's failure to fully realize them; It is in her opacity and contradictions that she is most fully aware of this and most representative.",
        "article_id": 0
    },
    {
        "sentence_id": 109,
        "sentence": "But Hardy knew exactly what happened between Su and the man who loved her.",
        "article_id": 0
    },
    {
        "sentence_id": 110,
        "sentence": "Her contradictions are far from opaque, and every evasive response she makes has its reasons.",
        "article_id": 0
    },
    {
        "sentence_id": 111,
        "sentence": "Like Clarissa later on, Eagleton never discovered what they were.",
        "article_id": 0
    },
    {
        "sentence_id": 112,
        "sentence": "If literary theory is not based on literary reading, then it has little value.",
        "article_id": 0
    }
]